# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv10n object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov10
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_Pstar, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_Pstar, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Pstar, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_Pstar, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, LCAM, [1024]] # 10

# YOLOv10.0n head
head:
  - [-1, 1, EfficientLocalizationAttention, []] # 10
  - [-1, 1, Conv, [256, 1]]
  - [-1, 3, C2f, [256]]

  - [6, 1, EfficientLocalizationAttention ,[]]
  - [-1, 1, Conv, [256, 1]]

  - [11, 1, DySample, [2]]
  - [-1, 1, EfficientLocalizationAttention, [False]]
  - [[-1, 14], 1, multiply, []]
  - [[-1, 15], 1, Add, []]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [4, 1, EfficientLocalizationAttention, []]
  - [-1, 1, Conv, [256,1]]

  - [15, 1, DySample, [2]]
  - [-1, 1, EfficientLocalizationAttention, [False]]
  - [[-1, 22], 1, multiply, []]
  - [[-1, 23], 1, Add, []]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2fCIB, [1024, True, True]]

  - [[12, 20, 28], 1, v10Detect, [nc]] # Det